fio/results/Amazon Web Services/c5d/read.out
job0: (g=0): rw=read, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=200
job1: (g=0): rw=read, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=200
job2: (g=0): rw=read, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=200
job3: (g=0): rw=read, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=200
fio-2.14
Starting 4 processes
{
  "fio version" : "fio-2.14",
  "timestamp" : 1583515013,
  "timestamp_ms" : 1583515013619,
  "time" : "Fri Mar  6 17:16:53 2020",
  "global options" : {
    "size" : "100g",
    "rw" : "read",
    "ioengine" : "libaio",
    "bs" : "1M",
    "nrfiles" : "1",
    "direct" : "1",
    "iodepth" : "200"
  },
  "jobs" : [
    {
      "jobname" : "job0",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 64,
      "job options" : {
        "filename" : "/dev/nvme1n1"
      },
      "read" : {
        "io_bytes" : 104857600,
        "bw" : 1663244,
        "iops" : 1624.262451,
        "runtime" : 63044,
        "total_ios" : 102400,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 22,
          "max" : 1348,
          "mean" : 612.789734,
          "stddev" : 151.343124
        },
        "clat" : {
          "min" : 9678,
          "max" : 134142,
          "mean" : 122452.539062,
          "stddev" : 12716.889648,
          "percentile" : {
            "1.000000" : 66048,
            "5.000000" : 104960,
            "10.000000" : 124416,
            "20.000000" : 125440,
            "30.000000" : 125440,
            "40.000000" : 125440,
            "50.000000" : 125440,
            "60.000000" : 125440,
            "70.000000" : 125440,
            "80.000000" : 125440,
            "90.000000" : 125440,
            "95.000000" : 125440,
            "99.000000" : 125440,
            "99.500000" : 126464,
            "99.900000" : 126464,
            "99.950000" : 126464,
            "99.990000" : 128512,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 10325,
          "max" : 134816,
          "mean" : 123065.328125,
          "stddev" : 12777.854492
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "write" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "trim" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "usr_cpu" : 0.513935,
      "sys_cpu" : 8.717859,
      "ctx" : 97480,
      "majf" : 0,
      "minf" : 51211,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.100000,
        "32" : 0.100000,
        ">=64" : 99.938477
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.010000,
        "20" : 0.015625,
        "50" : 0.046875,
        "100" : 4.910156,
        "250" : 95.026367,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 200,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    },
    {
      "jobname" : "job1",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 64,
      "job options" : {
        "filename" : "/dev/nvme2n1"
      },
      "read" : {
        "io_bytes" : 104857600,
        "bw" : 1663218,
        "iops" : 1624.236694,
        "runtime" : 63045,
        "total_ios" : 102400,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 21,
          "max" : 9641,
          "mean" : 612.421265,
          "stddev" : 154.325470
        },
        "clat" : {
          "min" : 9692,
          "max" : 134483,
          "mean" : 122451.335938,
          "stddev" : 12648.081055,
          "percentile" : {
            "1.000000" : 66048,
            "5.000000" : 93696,
            "10.000000" : 125440,
            "20.000000" : 125440,
            "30.000000" : 125440,
            "40.000000" : 125440,
            "50.000000" : 125440,
            "60.000000" : 125440,
            "70.000000" : 125440,
            "80.000000" : 125440,
            "90.000000" : 125440,
            "95.000000" : 125440,
            "99.000000" : 125440,
            "99.500000" : 125440,
            "99.900000" : 126464,
            "99.950000" : 126464,
            "99.990000" : 132096,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 10329,
          "max" : 135278,
          "mean" : 123063.757812,
          "stddev" : 12708.628906
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "write" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "trim" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "usr_cpu" : 0.567857,
      "sys_cpu" : 8.849375,
      "ctx" : 97498,
      "majf" : 0,
      "minf" : 51210,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.100000,
        "32" : 0.100000,
        ">=64" : 99.938477
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.010000,
        "20" : 0.015625,
        "50" : 0.046875,
        "100" : 4.967773,
        "250" : 94.968750,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 200,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    },
    {
      "jobname" : "job2",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 64,
      "job options" : {
        "filename" : "/dev/nvme3n1"
      },
      "read" : {
        "io_bytes" : 104857600,
        "bw" : 1663086,
        "iops" : 1624.107910,
        "runtime" : 63050,
        "total_ios" : 102400,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 21,
          "max" : 5769,
          "mean" : 612.823120,
          "stddev" : 134.806870
        },
        "clat" : {
          "min" : 9560,
          "max" : 134211,
          "mean" : 122456.625000,
          "stddev" : 12815.043945,
          "percentile" : {
            "1.000000" : 65280,
            "5.000000" : 122368,
            "10.000000" : 125440,
            "20.000000" : 125440,
            "30.000000" : 125440,
            "40.000000" : 125440,
            "50.000000" : 125440,
            "60.000000" : 125440,
            "70.000000" : 125440,
            "80.000000" : 125440,
            "90.000000" : 125440,
            "95.000000" : 125440,
            "99.000000" : 125440,
            "99.500000" : 125440,
            "99.900000" : 126464,
            "99.950000" : 126464,
            "99.990000" : 129536,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 10279,
          "max" : 134965,
          "mean" : 123069.445312,
          "stddev" : 12876.428711
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "write" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "trim" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "usr_cpu" : 0.428238,
      "sys_cpu" : 8.659931,
      "ctx" : 98653,
      "majf" : 0,
      "minf" : 51209,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.100000,
        "32" : 0.100000,
        ">=64" : 99.938477
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.010000,
        "20" : 0.015625,
        "50" : 0.045898,
        "100" : 4.823242,
        "250" : 95.114258,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 200,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    },
    {
      "jobname" : "job3",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 64,
      "job options" : {
        "filename" : "/dev/nvme4n1"
      },
      "read" : {
        "io_bytes" : 104857600,
        "bw" : 1663323,
        "iops" : 1624.339722,
        "runtime" : 63041,
        "total_ios" : 102400,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 21,
          "max" : 9679,
          "mean" : 612.229858,
          "stddev" : 114.901329
        },
        "clat" : {
          "min" : 9497,
          "max" : 134724,
          "mean" : 122448.289062,
          "stddev" : 12846.340820,
          "percentile" : {
            "1.000000" : 65280,
            "5.000000" : 119296,
            "10.000000" : 125440,
            "20.000000" : 125440,
            "30.000000" : 125440,
            "40.000000" : 125440,
            "50.000000" : 125440,
            "60.000000" : 125440,
            "70.000000" : 125440,
            "80.000000" : 125440,
            "90.000000" : 125440,
            "95.000000" : 125440,
            "99.000000" : 125440,
            "99.500000" : 125440,
            "99.900000" : 126464,
            "99.950000" : 126464,
            "99.990000" : 132096,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 10143,
          "max" : 135382,
          "mean" : 123060.523438,
          "stddev" : 12907.987305
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "write" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "trim" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "usr_cpu" : 0.632931,
      "sys_cpu" : 8.832487,
      "ctx" : 100487,
      "majf" : 0,
      "minf" : 51211,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.100000,
        "32" : 0.100000,
        ">=64" : 99.938477
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.010000,
        "20" : 0.015625,
        "50" : 0.045898,
        "100" : 4.830078,
        "250" : 95.107422,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 200,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "nvme1n1",
      "read_ios" : 817376,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 7751662,
      "write_ticks" : 0,
      "in_queue" : 6339852,
      "util" : 99.880875
    },
    {
      "name" : "nvme2n1",
      "read_ios" : 817365,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 7753009,
      "write_ticks" : 0,
      "in_queue" : 6347848,
      "util" : 99.904678
    },
    {
      "name" : "nvme3n1",
      "read_ios" : 817305,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 7746989,
      "write_ticks" : 0,
      "in_queue" : 6353360,
      "util" : 99.925316
    },
    {
      "name" : "nvme4n1",
      "read_ios" : 817413,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 7761903,
      "write_ticks" : 0,
      "in_queue" : 6358080,
      "util" : 99.939606
    }
  ]
}

job0: (groupid=0, jobs=1): err= 0: pid=38177: Fri Mar  6 17:16:53 2020
  read : io=102400MB, bw=1624.3MB/s, iops=1624, runt= 63044msec
    slat (usec): min=22, max=1348, avg=612.79, stdev=151.34
    clat (msec): min=9, max=134, avg=122.45, stdev=12.72
     lat (msec): min=10, max=134, avg=123.07, stdev=12.78
    clat percentiles (msec):
     |  1.00th=[   67],  5.00th=[  105], 10.00th=[  125], 20.00th=[  126],
     | 30.00th=[  126], 40.00th=[  126], 50.00th=[  126], 60.00th=[  126],
     | 70.00th=[  126], 80.00th=[  126], 90.00th=[  126], 95.00th=[  126],
     | 99.00th=[  126], 99.50th=[  127], 99.90th=[  127], 99.95th=[  127],
     | 99.99th=[  129]
    lat (msec) : 10=0.01%, 20=0.02%, 50=0.05%, 100=4.91%, 250=95.03%
  cpu          : usr=0.51%, sys=8.72%, ctx=97480, majf=0, minf=51211
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=102400/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=200
job1: (groupid=0, jobs=1): err= 0: pid=38178: Fri Mar  6 17:16:53 2020
  read : io=102400MB, bw=1624.3MB/s, iops=1624, runt= 63045msec
    slat (usec): min=21, max=9641, avg=612.42, stdev=154.33
    clat (msec): min=9, max=134, avg=122.45, stdev=12.65
     lat (msec): min=10, max=135, avg=123.06, stdev=12.71
    clat percentiles (msec):
     |  1.00th=[   67],  5.00th=[   94], 10.00th=[  126], 20.00th=[  126],
     | 30.00th=[  126], 40.00th=[  126], 50.00th=[  126], 60.00th=[  126],
     | 70.00th=[  126], 80.00th=[  126], 90.00th=[  126], 95.00th=[  126],
     | 99.00th=[  126], 99.50th=[  126], 99.90th=[  127], 99.95th=[  127],
     | 99.99th=[  133]
    lat (msec) : 10=0.01%, 20=0.02%, 50=0.05%, 100=4.97%, 250=94.97%
  cpu          : usr=0.57%, sys=8.85%, ctx=97498, majf=0, minf=51210
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=102400/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=200
job2: (groupid=0, jobs=1): err= 0: pid=38179: Fri Mar  6 17:16:53 2020
  read : io=102400MB, bw=1624.2MB/s, iops=1624, runt= 63050msec
    slat (usec): min=21, max=5769, avg=612.82, stdev=134.81
    clat (msec): min=9, max=134, avg=122.46, stdev=12.82
     lat (msec): min=10, max=134, avg=123.07, stdev=12.88
    clat percentiles (msec):
     |  1.00th=[   66],  5.00th=[  123], 10.00th=[  126], 20.00th=[  126],
     | 30.00th=[  126], 40.00th=[  126], 50.00th=[  126], 60.00th=[  126],
     | 70.00th=[  126], 80.00th=[  126], 90.00th=[  126], 95.00th=[  126],
     | 99.00th=[  126], 99.50th=[  126], 99.90th=[  127], 99.95th=[  127],
     | 99.99th=[  130]
    lat (msec) : 10=0.01%, 20=0.02%, 50=0.05%, 100=4.82%, 250=95.11%
  cpu          : usr=0.43%, sys=8.66%, ctx=98653, majf=0, minf=51209
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=102400/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=200
job3: (groupid=0, jobs=1): err= 0: pid=38180: Fri Mar  6 17:16:53 2020
  read : io=102400MB, bw=1624.4MB/s, iops=1624, runt= 63041msec
    slat (usec): min=21, max=9679, avg=612.23, stdev=114.90
    clat (msec): min=9, max=134, avg=122.45, stdev=12.85
     lat (msec): min=10, max=135, avg=123.06, stdev=12.91
    clat percentiles (msec):
     |  1.00th=[   66],  5.00th=[  120], 10.00th=[  126], 20.00th=[  126],
     | 30.00th=[  126], 40.00th=[  126], 50.00th=[  126], 60.00th=[  126],
     | 70.00th=[  126], 80.00th=[  126], 90.00th=[  126], 95.00th=[  126],
     | 99.00th=[  126], 99.50th=[  126], 99.90th=[  127], 99.95th=[  127],
     | 99.99th=[  133]
    lat (msec) : 10=0.01%, 20=0.02%, 50=0.05%, 100=4.83%, 250=95.11%
  cpu          : usr=0.63%, sys=8.83%, ctx=100487, majf=0, minf=51211
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=102400/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=200

Run status group 0 (all jobs):
   READ: io=409600MB, aggrb=6496.5MB/s, minb=1624.2MB/s, maxb=1624.4MB/s, mint=63041msec, maxt=63050msec

Disk stats (read/write):
  nvme1n1: ios=817376/0, merge=0/0, ticks=7751662/0, in_queue=6339852, util=99.88%
  nvme2n1: ios=817365/0, merge=0/0, ticks=7753009/0, in_queue=6347848, util=99.90%
  nvme3n1: ios=817305/0, merge=0/0, ticks=7746989/0, in_queue=6353360, util=99.93%
  nvme4n1: ios=817413/0, merge=0/0, ticks=7761903/0, in_queue=6358080, util=99.94%